# Outline Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..Outline Property
View Class See Also
---
The bounds of the view in paper space (in feet).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public BoundingBoxUV Outline { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Outline As BoundingBoxUV
	Get
```

Visual C++
---
```text
public:
property BoundingBoxUV^ Outline {
	BoundingBoxUV^ get ();
}
```

# Remarks
Returns all zeros for empty views.
# See Also
View Class
Autodesk.Revit.DB Namespace